{
  "backToTutorials": "ट्यूटोरियल्स पर वापस जाएं",
  "title": "आपका पहला MCP सर्वर",
  "difficulty": "शुरुआती",
  "duration": "15 मिनट",
  "overview": {
    "title": "आप क्या सीखेंगे",
    "description": "यह ट्यूटोरियल आपको Plugged.in में अपना पहला MCP सर्वर जोड़ने में मार्गदर्शन करेगा। MCP सर्वर टूल्स, संसाधनों और एकीकरण तक पहुंच प्रदान करके आपके AI की क्षमताओं का विस्तार करते हैं।",
    "learn1": "MCP सर्वर क्या हैं और वे कैसे काम करते हैं",
    "learn2": "आधिकारिक MCP सर्वर कैसे ब्राउज़ करें और जोड़ें",
    "learn3": "सर्वर सेटिंग्स और environment variables कैसे कॉन्फ़िगर करें",
    "learn4": "अपने सर्वर कनेक्शन का परीक्षण कैसे करें और इसके टूल्स का उपयोग कैसे करें"
  },
  "prerequisites": {
    "title": "पूर्वापेक्षाएं",
    "item1": "Plugged.in खाता (मुफ्त टियर पर्याप्त है)",
    "item2": "कमांड लाइन की बुनियादी समझ (कस्टम सर्वर के लिए)",
    "item3": "Node.js इंस्टॉल किया गया (वैकल्पिक, कस्टम सर्वर के लिए)"
  },
  "step1": {
    "title": "MCP सर्वर को समझना",
    "description": "इससे पहले कि हम अपना पहला सर्वर जोड़ें, आइए समझें कि MCP सर्वर क्या हैं और वे शक्तिशाली क्यों हैं।",
    "whatIs": {
      "title": "MCP सर्वर क्या है?",
      "description": "MCP (Model Context Protocol) सर्वर ऐसे प्रोग्राम हैं जो AI सहायकों को अतिरिक्त क्षमताएं प्रदान करते हैं। इन्हें ऐसे प्लगइन के रूप में सोचें जो आपके AI की क्षमताओं का विस्तार करते हैं।",
      "point1": "टूल्स: फंक्शन जिन्हें AI कॉल कर सकता है (जैसे, फाइलें पढ़ना, वेब खोजना, ईमेल भेजना)",
      "point2": "संसाधन: डेटा जिसे AI एक्सेस कर सकता है (जैसे, दस्तावेज़, डेटाबेस, APIs)",
      "point3": "प्रॉम्प्ट्स: विशिष्ट कार्यों के लिए पूर्व-कॉन्फ़िगर निर्देश"
    }
  },
  "step2": {
    "title": "MCP सर्वर पर नेविगेट करना",
    "description": "आइए Plugged.in में MCP सर्वर सेक्शन पर जाकर शुरू करें।",
    "screenshot": "स्क्रीनशॉट: MCP सर्वर मेनू हाइलाइट के साथ Plugged.in डैशबोर्ड",
    "screenshotDesc": "साइडबार नेविगेशन में MCP सर्वर विकल्प",
    "tip": "आप कीबोर्ड शॉर्टकट Cmd/Ctrl + K का भी उपयोग कर सकते हैं और वहां जल्दी पहुंचने के लिए 'MCP Servers' खोज सकते हैं।"
  },
  "step3": {
    "title": "अपना पहला सर्वर जोड़ना",
    "description": "अब आइए अपना पहला MCP सर्वर जोड़ें। आप आधिकारिक सर्वर या कस्टम सर्वर के बीच चुन सकते हैं।",
    "tabs": {
      "official": "आधिकारिक सर्वर",
      "custom": "कस्टम सर्वर"
    },
    "official": {
      "title": "एक आधिकारिक सर्वर जोड़ना",
      "step1": "'Add Server' बटन पर क्लिक करें",
      "step2": "आधिकारिक सर्वर कैटलॉग ब्राउज़ करें",
      "step3": "'Filesystem' सर्वर चुनें (एक अच्छा स्टार्टर सर्वर)",
      "step4": "इसे अपनी प्रोफाइल में जोड़ने के लिए 'Install' पर क्लिक करें",
      "screenshot": "स्क्रीनशॉट: Filesystem सर्वर के साथ आधिकारिक सर्वर कैटलॉग",
      "screenshotDesc": "विभिन्न MCP सर्वर दिखाता आधिकारिक सर्वर कैटलॉग"
    },
    "custom": {
      "title": "एक कस्टम सर्वर जोड़ना",
      "description": "अधिक नियंत्रण के लिए, आप एक कस्टम MCP सर्वर जोड़ सकते हैं:",
      "step1": "'Add Custom Server' पर क्लिक करें",
      "step2": "अपने सर्वर के लिए एक नाम दर्ज करें",
      "step3": "कमांड और आर्गुमेंट्स कॉन्फ़िगर करें"
    }
  },
  "step4": {
    "title": "अपने सर्वर को कॉन्फ़िगर करना",
    "description": "प्रत्येक सर्वर को विशिष्ट सेटिंग्स और environment variables के साथ कॉन्फ़िगर किया जा सकता है।",
    "settings": {
      "title": "बुनियादी कॉन्फ़िगरेशन",
      "description": "कॉन्फ़िगर करें कि आपका सर्वर कैसे चलता है:"
    },
    "env": {
      "title": "Environment Variables",
      "description": "कुछ सर्वरों को environment variables के माध्यम से API keys या अन्य कॉन्फ़िगरेशन की आवश्यकता होती है।",
      "note": "Environment variables एन्क्रिप्ट किए जाते हैं और Plugged.in में सुरक्षित रूप से संग्रहीत होते हैं"
    }
  },
  "step5": {
    "title": "अपने सर्वर का परीक्षण करना",
    "description": "आइए सुनिश्चित करें कि आपका सर्वर सही तरीके से काम कर रहा है।",
    "test": {
      "title": "कनेक्शन टेस्ट",
      "step1": "अपना सर्वर कॉन्फ़िगरेशन सेव करें",
      "step2": "'Test Connection' बटन पर क्लिक करें",
      "step3": "कनेक्शन स्थापित होने की प्रतीक्षा करें",
      "step4": "खोजे गए टूल्स और संसाधनों की जांच करें"
    },
    "screenshot": "स्क्रीनशॉट: सूचीबद्ध टूल्स के साथ सफल सर्वर कनेक्शन",
    "screenshotDesc": "उपलब्ध टूल्स दिखाता एक सफलतापूर्वक जुड़ा सर्वर"
  },
  "issues": {
    "title": "सामान्य समस्याएं और समाधान",
    "connection": {
      "title": "सर्वर कनेक्ट नहीं हो रहा",
      "description": "यदि आपका सर्वर कनेक्ट होने में विफल रहता है:",
      "solution1": "जांचें कि सभी आवश्यक फ़ील्ड भरे गए हैं",
      "solution2": "सत्यापित करें कि environment variables सही तरीके से सेट हैं",
      "solution3": "सुनिश्चित करें कि सर्वर कमांड/पथ सही है"
    },
    "tools": {
      "title": "कोई टूल दिखाई नहीं दे रहे",
      "description": "इसका आमतौर पर मतलब है कि सर्वर जुड़ा है लेकिन ठीक से कॉन्फ़िगर नहीं है। आवश्यक सेटअप के लिए सर्वर के दस्तावेज़ की जांच करें।"
    }
  },
  "nextSteps": {
    "title": "अगले चरण",
    "description": "बधाई हो! आपने अपना पहला MCP सर्वर जोड़ा है। यहां आगे जानने के लिए कुछ चीजें हैं:",
    "sharing": "समुदाय के साथ अपने सर्वर साझा करें",
    "custom": "एक कस्टम MCP सर्वर बनाएं"
  }
}